using System;

namespace Ref
{
    /*
     * 1. Написать метод Resize изменяющий количество элементов
массива (метод должен иметь возможность увеличить или
уменьшить количество элементов массива).

2. Написать методы для добавления элемента в начало массива, в
конец массива и по указанному индексу.

3. Написать методы для удаления первого элемента массива,
последнего элемента массива и элемента по указанному индексу.
    */
    class Program
    {
        static void Resize()
        {

        }
        static void Main() 
        {
        
        }

    }
}
